#### **4.Pandas基础**
##### **4.1 python数据结构--认识Series**

In [1]:
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
s = pd.Series([1,2,3,4], index = list('abcd'))
s

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
s.values

array([1, 2, 3, 4], dtype=int64)

In [5]:
[s['a'], s['b']]

[1, 2]

In [6]:
s[['a', 'b', 'c']]

a    1
b    2
c    3
dtype: int64

In [7]:
s > 2

a    False
b    False
c     True
d     True
dtype: bool

In [8]:
s[s>2]

c    3
d    4
dtype: int64

In [9]:
import numpy as np
np.mean(s)

2.5

In [10]:
s.sum()

10

In [11]:
['a' in s, 'e' in s]

[True, False]

In [12]:
['e' in s.index]

[False]

In [13]:
s['b'] = np.nan
s

a    1.0
b    NaN
c    3.0
d    4.0
dtype: float64

In [14]:
s.mean()
s.sum()

8.0

In [15]:
s1 = pd.Series([5,6,7], index = ['a' , 'f', 'c'])
s1

a    5
f    6
c    7
dtype: int64

In [16]:
s + s1

a     6.0
b     NaN
c    10.0
d     NaN
f     NaN
dtype: float64

##### **4.2 python数据结构--认识DataFrame**
+ DataFrame表示一个长方形表格，并包含排好序的列，每一列可以是不同的数值类型(数字,字符串,布尔值)。DataFrame有行索引和列索引，可以看作是分享所有索引的有Series组成的字典。数据是保存在一维以上的区块里的

In [17]:
data = pd.DataFrame(
    {
    'a': [1,2,3,4],
    'b': list('rfty'),
    'c': 1
    },
    index = ['one', 'two', 'three', 'four']
)
data

       a  b  c
one    1  r  1
two    2  f  1
three  3  t  1
four   4  y  1

In [18]:
# 行索引
data.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [19]:
# 列索引
data.columns

Index(['a', 'b', 'c'], dtype='object')

In [20]:
data.values

array([[1, 'r', 1],
       [2, 'f', 1],
       [3, 't', 1],
       [4, 'y', 1]], dtype=object)

In [21]:
index = ['one', 'two', 'three', 'four', 'five', 'six']
df = pd.DataFrame(np.random.randn(6,4), index = index, columns = list('abcd')) 
df

              a         b         c         d
one   -0.147031 -1.185039 -0.774935  0.308595
two   -1.438597 -1.014419  0.489477  0.649704
three -0.891525  0.069491 -1.422788  0.033784
four  -0.363906  0.388449 -0.324009  0.971932
five  -1.474149  0.486498 -0.221135  1.078785
six   -0.067446 -0.482200 -0.717862  1.026219

+ **取出df中的值**

In [22]:
df['a']

one     -0.147031
two     -1.438597
three   -0.891525
four    -0.363906
five    -1.474149
six     -0.067446
Name: a, dtype: float64

In [23]:
df['a']['three']

-0.891525012707464

In [24]:
df.a

one     -0.147031
two     -1.438597
three   -0.891525
four    -0.363906
five    -1.474149
six     -0.067446
Name: a, dtype: float64

In [25]:
df.a.three

-0.891525012707464

In [26]:
type(df.a)

pandas.core.series.Series

+ **双中括号取多列**

In [27]:
df[['a', 'b']]

              a         b
one   -0.147031 -1.185039
two   -1.438597 -1.014419
three -0.891525  0.069491
four  -0.363906  0.388449
five  -1.474149  0.486498
six   -0.067446 -0.482200

+ **选取多行**

In [28]:
df[0:2]

            a         b         c         d
one -0.147031 -1.185039 -0.774935  0.308595
two -1.438597 -1.014419  0.489477  0.649704

+ **loc根据索引取多行值**

In [29]:
df.loc['one']

a   -0.147031
b   -1.185039
c   -0.774935
d    0.308595
Name: one, dtype: float64

In [30]:
df.loc[['one', 'three']]

              a         b         c         d
one   -0.147031 -1.185039 -0.774935  0.308595
three -0.891525  0.069491 -1.422788  0.033784

In [31]:
# 前包括 + 后包括
df.loc['one':'three']

              a         b         c         d
one   -0.147031 -1.185039 -0.774935  0.308595
two   -1.438597 -1.014419  0.489477  0.649704
three -0.891525  0.069491 -1.422788  0.033784

In [32]:
df.loc['one':'three', 'c':]

              c         d
one   -0.774935  0.308595
two    0.489477  0.649704
three -1.422788  0.033784

In [33]:
df.loc['one':'three', 'c']

one     -0.774935
two      0.489477
three   -1.422788
Name: c, dtype: float64

+ **iloc根据位置取多行值**(前包括后不包括)

In [34]:
df.iloc[1:3]

              a         b         c         d
two   -1.438597 -1.014419  0.489477  0.649704
three -0.891525  0.069491 -1.422788  0.033784

In [35]:
df.iloc[1:3, 1:]

              b         c         d
two   -1.014419  0.489477  0.649704
three  0.069491 -1.422788  0.033784

##### **4.3 DataFrame添加删除数据以及运算特点**

In [36]:
xuhao = ['one', 'two', 'three', 'four', 'five', 'six', 'seven']
data = pd.DataFrame(np.random.randn(7,4), index = xuhao, columns = list('abcd')) 
data

              a         b         c         d
one    1.223521 -0.727641  1.632407  0.710552
two    0.740826 -0.286074 -0.293368  1.534549
three  0.916008  0.862511 -2.479221 -0.350486
four  -0.506387  0.895404 -0.591576  0.061043
five  -1.462403 -0.420341  0.152088 -0.134021
six    0.697406  0.535282 -0.417625 -0.112981
seven -1.223953  0.184059 -0.687621 -0.239499

In [37]:
data['e'] = np.arange(7)
data

              a         b         c         d  e
one    1.223521 -0.727641  1.632407  0.710552  0
two    0.740826 -0.286074 -0.293368  1.534549  1
three  0.916008  0.862511 -2.479221 -0.350486  2
four  -0.506387  0.895404 -0.591576  0.061043  3
five  -1.462403 -0.420341  0.152088 -0.134021  4
six    0.697406  0.535282 -0.417625 -0.112981  5
seven -1.223953  0.184059 -0.687621 -0.239499  6

In [38]:
del data['e']
data

              a         b         c         d
one    1.223521 -0.727641  1.632407  0.710552
two    0.740826 -0.286074 -0.293368  1.534549
three  0.916008  0.862511 -2.479221 -0.350486
four  -0.506387  0.895404 -0.591576  0.061043
five  -1.462403 -0.420341  0.152088 -0.134021
six    0.697406  0.535282 -0.417625 -0.112981
seven -1.223953  0.184059 -0.687621 -0.239499

+ **.点语法在增加行和改变列并不通用，只能改变**

In [39]:
data.f = 8
data

              a         b         c         d
one    1.223521 -0.727641  1.632407  0.710552
two    0.740826 -0.286074 -0.293368  1.534549
three  0.916008  0.862511 -2.479221 -0.350486
four  -0.506387  0.895404 -0.591576  0.061043
five  -1.462403 -0.420341  0.152088 -0.134021
six    0.697406  0.535282 -0.417625 -0.112981
seven -1.223953  0.184059 -0.687621 -0.239499

+ **添加删除行**

In [40]:
data.drop(['seven'])

              a         b         c         d
one    1.223521 -0.727641  1.632407  0.710552
two    0.740826 -0.286074 -0.293368  1.534549
three  0.916008  0.862511 -2.479221 -0.350486
four  -0.506387  0.895404 -0.591576  0.061043
five  -1.462403 -0.420341  0.152088 -0.134021
six    0.697406  0.535282 -0.417625 -0.112981

+ **.drop()只是生成了新的数据，并没有改变原文件**

In [41]:
data

              a         b         c         d
one    1.223521 -0.727641  1.632407  0.710552
two    0.740826 -0.286074 -0.293368  1.534549
three  0.916008  0.862511 -2.479221 -0.350486
four  -0.506387  0.895404 -0.591576  0.061043
five  -1.462403 -0.420341  0.152088 -0.134021
six    0.697406  0.535282 -0.417625 -0.112981
seven -1.223953  0.184059 -0.687621 -0.239499

In [42]:
data.drop(['one', 'two'])

              a         b         c         d
three  0.916008  0.862511 -2.479221 -0.350486
four  -0.506387  0.895404 -0.591576  0.061043
five  -1.462403 -0.420341  0.152088 -0.134021
six    0.697406  0.535282 -0.417625 -0.112981
seven -1.223953  0.184059 -0.687621 -0.239499

+ **用inplace参数直接改变源文件**

In [43]:
data.drop(['seven','three'], inplace=True)

In [44]:
data

             a         b         c         d
one   1.223521 -0.727641  1.632407  0.710552
two   0.740826 -0.286074 -0.293368  1.534549
four -0.506387  0.895404 -0.591576  0.061043
five -1.462403 -0.420341  0.152088 -0.134021
six   0.697406  0.535282 -0.417625 -0.112981

+ **axis = 1表示列， axis = 0表示行**

In [45]:
data.drop('a', axis=1)

             b         c         d
one  -0.727641  1.632407  0.710552
two  -0.286074 -0.293368  1.534549
four  0.895404 -0.591576  0.061043
five -0.420341  0.152088 -0.134021
six   0.535282 -0.417625 -0.112981

In [46]:
# data.loc['ten'] = np.random.randn(1,4)
data

             a         b         c         d
one   1.223521 -0.727641  1.632407  0.710552
two   0.740826 -0.286074 -0.293368  1.534549
four -0.506387  0.895404 -0.591576  0.061043
five -1.462403 -0.420341  0.152088 -0.134021
six   0.697406  0.535282 -0.417625 -0.112981

+ **在DataFrame中，数据对齐同时发生在行和列上**

In [47]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns = list('bcd'),
                  index = ['one','two','three'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
                  index = ['three', 'four', 'five', 'six'])
df1,df2

(         b    c    d
 one    0.0  1.0  2.0
 two    3.0  4.0  5.0
 three  6.0  7.0  8.0,
          b     d     e
 three  0.0   1.0   2.0
 four   3.0   4.0   5.0
 five   6.0   7.0   8.0
 six    9.0  10.0  11.0)

In [48]:
df1 + df2

         b   c    d   e
five   NaN NaN  NaN NaN
four   NaN NaN  NaN NaN
one    NaN NaN  NaN NaN
six    NaN NaN  NaN NaN
three  6.0 NaN  9.0 NaN
two    NaN NaN  NaN NaN

In [49]:
s1 = df1.iloc[0]
s1

b    0.0
c    1.0
d    2.0
Name: one, dtype: float64

In [50]:
df1

         b    c    d
one    0.0  1.0  2.0
two    3.0  4.0  5.0
three  6.0  7.0  8.0

In [51]:
df1 - s1

         b    c    d
one    0.0  0.0  0.0
two    3.0  3.0  3.0
three  6.0  6.0  6.0

In [52]:
s2 = pd.Series(range(3), index = ['b','e','f'])
s2

b    0
e    1
f    2
dtype: int64

In [53]:
df1 - s2

         b   c   d   e   f
one    0.0 NaN NaN NaN NaN
two    3.0 NaN NaN NaN NaN
three  6.0 NaN NaN NaN NaN

In [54]:
np.abs(df1)

         b    c    d
one    0.0  1.0  2.0
two    3.0  4.0  5.0
three  6.0  7.0  8.0

In [55]:
np.mean(df1)

b    3.0
c    4.0
d    5.0
dtype: float64

In [56]:
1/df1

              b         c      d
one         inf  1.000000  0.500
two    0.333333  0.250000  0.200
three  0.166667  0.142857  0.125

+ **4.4 DataFrame数据排序和重新索引**

In [57]:
data = pd.DataFrame(np.random.rand(9,6), columns = list('cdafbe'))
data

          c         d         a         f         b         e
0  0.876393  0.542810  0.982710  0.658837  0.590216  0.580122
1  0.098983  0.249922  0.687483  0.125248  0.666582  0.227405
2  0.371968  0.938309  0.559082  0.649536  0.124434  0.701001
3  0.106327  0.239245  0.544481  0.286428  0.507504  0.168856
4  0.024600  0.698147  0.582762  0.725091  0.393957  0.474147
5  0.293492  0.992006  0.031340  0.039088  0.643286  0.760822
6  0.022081  0.454180  0.946739  0.573755  0.010548  0.909636
7  0.790196  0.297769  0.670929  0.416600  0.684626  0.914856
8  0.536129  0.140736  0.984705  0.548298  0.713773  0.323464

In [58]:
# 升序方法
data.sort_index()

          c         d         a         f         b         e
0  0.876393  0.542810  0.982710  0.658837  0.590216  0.580122
1  0.098983  0.249922  0.687483  0.125248  0.666582  0.227405
2  0.371968  0.938309  0.559082  0.649536  0.124434  0.701001
3  0.106327  0.239245  0.544481  0.286428  0.507504  0.168856
4  0.024600  0.698147  0.582762  0.725091  0.393957  0.474147
5  0.293492  0.992006  0.031340  0.039088  0.643286  0.760822
6  0.022081  0.454180  0.946739  0.573755  0.010548  0.909636
7  0.790196  0.297769  0.670929  0.416600  0.684626  0.914856
8  0.536129  0.140736  0.984705  0.548298  0.713773  0.323464

In [59]:
# 降序方法
data.sort_index(ascending=False)

          c         d         a         f         b         e
8  0.536129  0.140736  0.984705  0.548298  0.713773  0.323464
7  0.790196  0.297769  0.670929  0.416600  0.684626  0.914856
6  0.022081  0.454180  0.946739  0.573755  0.010548  0.909636
5  0.293492  0.992006  0.031340  0.039088  0.643286  0.760822
4  0.024600  0.698147  0.582762  0.725091  0.393957  0.474147
3  0.106327  0.239245  0.544481  0.286428  0.507504  0.168856
2  0.371968  0.938309  0.559082  0.649536  0.124434  0.701001
1  0.098983  0.249922  0.687483  0.125248  0.666582  0.227405
0  0.876393  0.542810  0.982710  0.658837  0.590216  0.580122

+ **列项升序**

In [60]:
data.sort_index(axis=1)

          a         b         c         d         e         f
0  0.982710  0.590216  0.876393  0.542810  0.580122  0.658837
1  0.687483  0.666582  0.098983  0.249922  0.227405  0.125248
2  0.559082  0.124434  0.371968  0.938309  0.701001  0.649536
3  0.544481  0.507504  0.106327  0.239245  0.168856  0.286428
4  0.582762  0.393957  0.024600  0.698147  0.474147  0.725091
5  0.031340  0.643286  0.293492  0.992006  0.760822  0.039088
6  0.946739  0.010548  0.022081  0.454180  0.909636  0.573755
7  0.670929  0.684626  0.790196  0.297769  0.914856  0.416600
8  0.984705  0.713773  0.536129  0.140736  0.323464  0.548298

In [61]:
data.sort_index(axis = 1, ascending=False)

          f         e         d         c         b         a
0  0.658837  0.580122  0.542810  0.876393  0.590216  0.982710
1  0.125248  0.227405  0.249922  0.098983  0.666582  0.687483
2  0.649536  0.701001  0.938309  0.371968  0.124434  0.559082
3  0.286428  0.168856  0.239245  0.106327  0.507504  0.544481
4  0.725091  0.474147  0.698147  0.024600  0.393957  0.582762
5  0.039088  0.760822  0.992006  0.293492  0.643286  0.031340
6  0.573755  0.909636  0.454180  0.022081  0.010548  0.946739
7  0.416600  0.914856  0.297769  0.790196  0.684626  0.670929
8  0.548298  0.323464  0.140736  0.536129  0.713773  0.984705

+ **列排序**

In [62]:
data.sort_values(by = 'c')

          c         d         a         f         b         e
6  0.022081  0.454180  0.946739  0.573755  0.010548  0.909636
4  0.024600  0.698147  0.582762  0.725091  0.393957  0.474147
1  0.098983  0.249922  0.687483  0.125248  0.666582  0.227405
3  0.106327  0.239245  0.544481  0.286428  0.507504  0.168856
5  0.293492  0.992006  0.031340  0.039088  0.643286  0.760822
2  0.371968  0.938309  0.559082  0.649536  0.124434  0.701001
8  0.536129  0.140736  0.984705  0.548298  0.713773  0.323464
7  0.790196  0.297769  0.670929  0.416600  0.684626  0.914856
0  0.876393  0.542810  0.982710  0.658837  0.590216  0.580122

In [63]:
data.sort_values(by = ['c', 'd'])

          c         d         a         f         b         e
6  0.022081  0.454180  0.946739  0.573755  0.010548  0.909636
4  0.024600  0.698147  0.582762  0.725091  0.393957  0.474147
1  0.098983  0.249922  0.687483  0.125248  0.666582  0.227405
3  0.106327  0.239245  0.544481  0.286428  0.507504  0.168856
5  0.293492  0.992006  0.031340  0.039088  0.643286  0.760822
2  0.371968  0.938309  0.559082  0.649536  0.124434  0.701001
8  0.536129  0.140736  0.984705  0.548298  0.713773  0.323464
7  0.790196  0.297769  0.670929  0.416600  0.684626  0.914856
0  0.876393  0.542810  0.982710  0.658837  0.590216  0.580122

In [64]:
s = pd.Series([7,-5,7,4,2,0,4])
s

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [65]:
s.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [66]:
s.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [67]:
s.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [68]:
data.rank()

     c    d    a    f    b    e
0  9.0  6.0  8.0  8.0  5.0  5.0
1  3.0  3.0  6.0  2.0  7.0  2.0
2  6.0  8.0  3.0  7.0  2.0  6.0
3  4.0  2.0  2.0  3.0  4.0  1.0
4  2.0  7.0  4.0  9.0  3.0  4.0
5  5.0  9.0  1.0  1.0  6.0  7.0
6  1.0  5.0  7.0  6.0  1.0  8.0
7  8.0  4.0  5.0  4.0  8.0  9.0
8  7.0  1.0  9.0  5.0  9.0  3.0

In [69]:
data

          c         d         a         f         b         e
0  0.876393  0.542810  0.982710  0.658837  0.590216  0.580122
1  0.098983  0.249922  0.687483  0.125248  0.666582  0.227405
2  0.371968  0.938309  0.559082  0.649536  0.124434  0.701001
3  0.106327  0.239245  0.544481  0.286428  0.507504  0.168856
4  0.024600  0.698147  0.582762  0.725091  0.393957  0.474147
5  0.293492  0.992006  0.031340  0.039088  0.643286  0.760822
6  0.022081  0.454180  0.946739  0.573755  0.010548  0.909636
7  0.790196  0.297769  0.670929  0.416600  0.684626  0.914856
8  0.536129  0.140736  0.984705  0.548298  0.713773  0.323464

+ **重新排序**(列)

In [70]:
data.reindex(columns = ['a','e','f','d','b','c'])

          a         e         f         d         b         c
0  0.982710  0.580122  0.658837  0.542810  0.590216  0.876393
1  0.687483  0.227405  0.125248  0.249922  0.666582  0.098983
2  0.559082  0.701001  0.649536  0.938309  0.124434  0.371968
3  0.544481  0.168856  0.286428  0.239245  0.507504  0.106327
4  0.582762  0.474147  0.725091  0.698147  0.393957  0.024600
5  0.031340  0.760822  0.039088  0.992006  0.643286  0.293492
6  0.946739  0.909636  0.573755  0.454180  0.010548  0.022081
7  0.670929  0.914856  0.416600  0.297769  0.684626  0.790196
8  0.984705  0.323464  0.548298  0.140736  0.713773  0.536129

In [71]:
data.reindex(columns = ['a','e','f','d','r','c'])

          a         e         f         d   r         c
0  0.982710  0.580122  0.658837  0.542810 NaN  0.876393
1  0.687483  0.227405  0.125248  0.249922 NaN  0.098983
2  0.559082  0.701001  0.649536  0.938309 NaN  0.371968
3  0.544481  0.168856  0.286428  0.239245 NaN  0.106327
4  0.582762  0.474147  0.725091  0.698147 NaN  0.024600
5  0.031340  0.760822  0.039088  0.992006 NaN  0.293492
6  0.946739  0.909636  0.573755  0.454180 NaN  0.022081
7  0.670929  0.914856  0.416600  0.297769 NaN  0.790196
8  0.984705  0.323464  0.548298  0.140736 NaN  0.536129

In [72]:
data.reindex(index = [1,2,4,3,5,6,0,7,8])

          c         d         a         f         b         e
1  0.098983  0.249922  0.687483  0.125248  0.666582  0.227405
2  0.371968  0.938309  0.559082  0.649536  0.124434  0.701001
4  0.024600  0.698147  0.582762  0.725091  0.393957  0.474147
3  0.106327  0.239245  0.544481  0.286428  0.507504  0.168856
5  0.293492  0.992006  0.031340  0.039088  0.643286  0.760822
6  0.022081  0.454180  0.946739  0.573755  0.010548  0.909636
0  0.876393  0.542810  0.982710  0.658837  0.590216  0.580122
7  0.790196  0.297769  0.670929  0.416600  0.684626  0.914856
8  0.536129  0.140736  0.984705  0.548298  0.713773  0.323464

+ **重新排序**(行)

In [73]:
data.reindex(index = [1,8])

          c         d         a         f         b         e
1  0.098983  0.249922  0.687483  0.125248  0.666582  0.227405
8  0.536129  0.140736  0.984705  0.548298  0.713773  0.323464

##### **4.5 数据观察和汇总统计方法**

In [74]:
data = pd.DataFrame(np.random.randn(9,6), columns = list('abcdef'))
data

          a         b         c         d         e         f
0  0.375853  1.519108 -1.173355  0.640436 -0.741248  0.736781
1  0.324085 -0.739253 -0.517197 -1.032798 -0.134372  0.178032
2 -1.606432  0.062452  0.776455  0.455097 -0.619261 -0.541645
3  0.195133 -0.474277  0.368004 -0.629071  0.200340  1.993811
4 -1.096395 -0.747987 -0.821300  0.527070  0.248423 -1.502304
5  0.659788 -1.185040 -0.531651 -1.125096  0.204715 -2.043513
6 -0.654908  0.434679  0.069856  0.297033  1.800932  1.383466
7 -0.660408 -0.463925  0.304483 -0.169458  2.071162 -0.265542
8 -0.468856  0.503494 -1.296672 -1.249136  1.273611  1.349171

+ **只看部分数据**

In [75]:
data.head(3)

          a         b         c         d         e         f
0  0.375853  1.519108 -1.173355  0.640436 -0.741248  0.736781
1  0.324085 -0.739253 -0.517197 -1.032798 -0.134372  0.178032
2 -1.606432  0.062452  0.776455  0.455097 -0.619261 -0.541645

In [76]:
data.tail() #默认5行

          a         b         c         d         e         f
4 -1.096395 -0.747987 -0.821300  0.527070  0.248423 -1.502304
5  0.659788 -1.185040 -0.531651 -1.125096  0.204715 -2.043513
6 -0.654908  0.434679  0.069856  0.297033  1.800932  1.383466
7 -0.660408 -0.463925  0.304483 -0.169458  2.071162 -0.265542
8 -0.468856  0.503494 -1.296672 -1.249136  1.273611  1.349171

In [77]:
data.describe()

              a         b         c         d         e         f
count  9.000000  9.000000  9.000000  9.000000  9.000000  9.000000
mean  -0.325793 -0.121194 -0.313486 -0.253992  0.478256  0.143140
std    0.760920  0.834589  0.727516  0.768114  1.011888  1.364570
min   -1.606432 -1.185040 -1.296672 -1.249136 -0.741248 -2.043513
25%   -0.660408 -0.739253 -0.821300 -1.032798 -0.134372 -0.541645
50%   -0.468856 -0.463925 -0.517197 -0.169458  0.204715  0.178032
75%    0.324085  0.434679  0.304483  0.455097  1.273611  1.349171
max    0.659788  1.519108  0.776455  0.640436  2.071162  1.993811

+ **按行求和**

In [78]:
data.sum() # 默认在行进行统计

a   -2.932141
b   -1.090749
c   -2.821377
d   -2.285924
e    4.304303
f    1.288258
dtype: float64

+ **按列求和**

In [79]:
data.sum(axis = 1)

0    1.357576
1   -1.921505
2   -1.473333
3    1.653940
4   -3.392493
5   -4.020796
6    3.331057
7    0.816313
8    0.111612
dtype: float64

In [80]:
data.mean(1)

0    0.226263
1   -0.320251
2   -0.245556
3    0.275657
4   -0.565416
5   -0.670133
6    0.555176
7    0.136052
8    0.018602
dtype: float64

In [81]:
data.idxmax() # 返回每一列最大值的索引

a    5
b    0
c    2
d    0
e    7
f    3
dtype: int64

In [82]:
data.idxmin(1) # 返回每一行最小值的索引

0    c
1    d
2    a
3    d
4    f
5    f
6    a
7    a
8    c
dtype: object

In [83]:
data = pd.DataFrame(np.random.randint(5,10,(5,6)), columns = list('abcdef'))
data

   a  b  c  d  e  f
0  7  9  9  7  5  7
1  8  7  8  6  8  5
2  6  8  8  7  8  7
3  9  5  5  9  8  7
4  8  9  7  8  9  5

In [84]:
data.a

0    7
1    8
2    6
3    9
4    8
Name: a, dtype: int32

+ **a列有几个值**

In [85]:
data.a.unique()

array([7, 8, 6, 9])

In [86]:
data.a.value_counts() # 值的个数

8    2
7    1
6    1
9    1
Name: a, dtype: int64

In [87]:
data = pd.DataFrame(np.random.randn(9,6), columns = list('abcdef'))
data

          a         b         c         d         e         f
0  0.315330 -0.150083 -0.873070  1.607490 -0.122311 -0.861971
1  0.515654 -0.265971  1.304478  0.396496 -1.929169  0.144007
2  1.385082 -0.198583  0.772750  0.295520  1.916530 -0.003821
3 -1.407186 -0.140876 -0.329780 -1.156591  1.454377  0.492252
4  0.059937  0.675811 -0.461315 -0.585324 -0.499242  1.251045
5 -1.400392 -0.639974  0.339780 -0.730997  0.562519  2.049195
6  0.269825 -2.164703  0.972167  1.346113  0.769610  0.126224
7 -1.605936  0.690875  0.795151  0.250970 -1.187519 -1.024107
8 -1.203418 -1.627366  0.067820 -2.052462  0.935621  0.071090

+ **后一行相对于前一行的百分比变化**

In [88]:
data.pct_change()

           a         b         c         d          e           f
0        NaN       NaN       NaN       NaN        NaN         NaN
1   0.635283  0.772159 -2.494129 -0.753345  14.772594   -1.167067
2   1.686067 -0.253365 -0.407618 -0.254671  -1.993449   -1.026533
3  -2.015959 -0.290593 -1.426762 -4.913749  -0.241141 -129.828430
4  -1.042593 -5.797201  0.398855 -0.493924  -1.343269    1.541474
5 -24.364497 -1.946972 -1.736548  0.248878  -2.126746    0.637987
6  -1.192679  2.382487  1.861164 -2.841474   0.368149   -0.938403
7  -6.951759 -1.319155 -0.182084 -0.813559  -2.543014   -9.113385
8  -0.250644 -3.355513 -0.914708 -9.178103  -1.787878   -1.069416

+ **累加**

In [89]:
data.cumsum()

          a         b         c         d         e         f
0  0.315330 -0.150083 -0.873070  1.607490 -0.122311 -0.861971
1  0.830984 -0.416053  0.431409  2.003986 -2.051480 -0.717964
2  2.216066 -0.614636  1.204158  2.299506 -0.134950 -0.721785
3  0.808880 -0.755512  0.874378  1.142915  1.319427 -0.229533
4  0.868817 -0.079702  0.413063  0.557591  0.820185  1.021511
5 -0.531575 -0.719675  0.752843 -0.173406  1.382704  3.070706
6 -0.261750 -2.884378  1.725011  1.172706  2.152314  3.196931
7 -1.867686 -2.193503  2.520162  1.423677  0.964794  2.172824
8 -3.071104 -3.820869  2.587982 -0.628786  1.900415  2.243913

+ **相关系数**

In [90]:
data.corr()

          a         b         c         d         e         f
a  1.000000 -0.044451  0.191551  0.586806  0.036504 -0.161964
b -0.044451  1.000000 -0.253803  0.018167 -0.415392 -0.081071
c  0.191551 -0.253803  1.000000  0.186780 -0.225699 -0.077913
d  0.586806  0.018167  0.186780  1.000000 -0.274982 -0.468080
e  0.036504 -0.415392 -0.225699 -0.274982  1.000000  0.205984
f -0.161964 -0.081071 -0.077913 -0.468080  0.205984  1.000000

+ **某一列的相关系数**

In [91]:
data.corrwith(data.a)

a    1.000000
b   -0.044451
c    0.191551
d    0.586806
e    0.036504
f   -0.161964
dtype: float64

+ **协方差**

In [92]:
data.cov()

          a         b         c         d         e         f
a  1.160092 -0.045446  0.151888  0.744048  0.049279 -0.166421
b -0.045446  0.901036 -0.177362  0.020301 -0.494201 -0.073414
c  0.151888 -0.177362  0.541983  0.161877 -0.208256 -0.054719
d  0.744048  0.020301  0.161877  1.385863 -0.405732 -0.525680
e  0.049279 -0.494201 -0.208256 -0.405732  1.570903  0.246292
f -0.166421 -0.073414 -0.054719 -0.525680  0.246292  0.910086

##### **4.6 数据的加载与存储**
+ **读取数据**

In [93]:
data = pd.read_csv('E:\Anaconda\datacsv1.csv')
data.head()

  Data  a1  a2  a3  a4  a5  a6  a7
0   b1   1   2   3   4   5   6   7
1   b2  11  22  33  44  55  66  77
2   b3  12  13  14  15  16  17  18
3   b4  13  23  33  43  53  63  73
4   b5  14  24  34  44  54  64  74

In [94]:
data.describe()

,a1,a2,a3,a4,a5,a6,a7
count,11.000000,11.000000,11.000000,11.000000,11.000000,11.000000,11.000000
mean,14.181818,22.727273,31.272727,39.818182,48.363636,56.909091,65.454545
std,5.231026,10.882012,18.044894,25.474765,32.991735,40.547391,48.123515
min,1.000000,2.000000,3.000000,3.000000,-2.000000,-7.000000,-12.000000
25%,12.500000,17.500000,22.000000,26.000000,30.000000,34.000000,38.000000
50%,15.000000,23.000000,33.000000,43.000000,53.000000,63.000000,73.000000
75%,17.500000,28.000000,40.000000,51.500000,63.500000,75.500000,87.500000
max,20.000000,42.000000,65.000000,88.000000,111.000000,134.000000,157.000000

In [95]:
data = pd.read_table('E:\Anaconda\datacsv1.csv', sep=',')
data.head(2)

  Data  a1  a2  a3  a4  a5  a6  a7
0   b1   1   2   3   4   5   6   7
1   b2  11  22  33  44  55  66  77

In [96]:
# data = pd.read_csv('E:\Anaconda\datacsv1.csv', header = None)

In [97]:
names = data.columns # name = data.index
names

Index(['Data', 'a1', 'a2', 'a3', 'a4', 'a5', 'a6', 'a7'], dtype='object')

In [98]:
data = pd.read_table('E:\Anaconda\datacsv1.csv', sep=',', names = names)
data.head(2)

   Data  a1  a2  a3  a4  a5  a6  a7
0  Data  a1  a2  a3  a4  a5  a6  a7
1    b1   1   2   3   4   5   6   7

In [99]:
# data = pd.read_table('E:\Anaconda\datacsv1.csv', index_col = 'Location')

In [100]:
data = pd.read_table('E:\Anaconda\datacsv1.csv', nrows = 3)
data

  Data,a1,a2,a3,a4,a5,a6,a7
0          b1,1,2,3,4,5,6,7
1   b2,11,22,33,44,55,66,77
2   b3,12,13,14,15,16,17,18

+ **保存新的文件**

In [101]:
# data.to_csv('datacsv2.csv', index = False)

In [102]:
data = pd.read_excel('E:\Anaconda\dataxlsx1.xlsx')
data.head()

  Data  a1  a2  a3  a4  a5  a6  a7
0   b1   1   2   3   4   5   6   7
1   b2  11  22  33  44  55  66  77
2   b3  12  13  14  15  16  17  18
3   b4  13  23  33  43  53  63  73
4   b5  14  24  34  44  54  64  74

In [103]:
# data = pd.read_excel('E:\Anaconda\dataxlsx1.xlsx', sheet_name = 'sheet_1')

In [104]:
# data.to_excel('E:\Anaconda\dataxlsx2.xlsx')

In [105]:
pd.read_pickle
pd.read_json
1

1

##### **4.7 合并数据集**

In [106]:
data_1 = pd.DataFrame(
    {'one':['a','b','a','a','c','b'], 
     'twol':range(6)
    }
)
data_2 = pd.DataFrame(
    {'one':['a','b','c','d'], 
     'two2':range(10,14)
    }
)
data_1

  one  twol
0   a     0
1   b     1
2   a     2
3   a     3
4   c     4
5   b     5

In [107]:
data_2

  one  two2
0   a    10
1   b    11
2   c    12
3   d    13

In [108]:
pd.merge(data_1,data_2)

  one  twol  two2
0   a     0    10
1   a     2    10
2   a     3    10
3   b     1    11
4   b     5    11
5   c     4    12

In [109]:
data_1 = pd.DataFrame(
    {'one':['a','b','a','a','c','b'], 
     'two':range(6)
    }
)
data_2 = pd.DataFrame(
    {'one':['a','b','c','d'], 
     'two':range(10,14)
    }
)

In [110]:
pd.merge(data_1,data_2,on = 'one')

  one  two_x  two_y
0   a      0     10
1   a      2     10
2   a      3     10
3   b      1     11
4   b      5     11
5   c      4     12

In [111]:
data_1 = pd.DataFrame(
    {'one1':['a','b','a','a','c','b'], 
     'two1':range(6)
    }
)
data_2 = pd.DataFrame(
    {'one2':['a','b','c','d'], 
     'two2':range(10,14)
    }
)

In [112]:
pd.merge(data_1,data_2, left_on = 'one1', right_on = 'one2')

  one1  two1 one2  two2
0    a     0    a    10
1    a     2    a    10
2    a     3    a    10
3    b     1    b    11
4    b     5    b    11
5    c     4    c    12

In [113]:
data_1 = pd.DataFrame(
    {'one':['a','b','a','a','e'], 
     'two1':range(5)
    }
)
data_2 = pd.DataFrame(
    {'one':['a','b','c','d'], 
     'two2':range(10,14)
    }
)
data_1

  one  two1
0   a     0
1   b     1
2   a     2
3   a     3
4   e     4

In [114]:
data_2

  one  two2
0   a    10
1   b    11
2   c    12
3   d    13

In [115]:
pd.merge(data_1,data_2)

  one  two1  two2
0   a     0    10
1   a     2    10
2   a     3    10
3   b     1    11

In [116]:
pd.merge(data_1,data_2, how = 'inner')

  one  two1  two2
0   a     0    10
1   a     2    10
2   a     3    10
3   b     1    11

In [117]:
pd.merge(data_1,data_2, how = 'outer')

  one  two1  two2
0   a   0.0  10.0
1   a   2.0  10.0
2   a   3.0  10.0
3   b   1.0  11.0
4   e   4.0   NaN
5   c   NaN  12.0
6   d   NaN  13.0

In [118]:
pd.merge(data_1,data_2, how = 'right')

  one  two1  two2
0   a   0.0    10
1   a   2.0    10
2   a   3.0    10
3   b   1.0    11
4   c   NaN    12
5   d   NaN    13

In [119]:
pd.merge(data_1,data_2, how = 'left')

  one  two1  two2
0   a     0  10.0
1   b     1  11.0
2   a     2  10.0
3   a     3  10.0
4   e     4   NaN

In [120]:
pd.merge(data_1,data_2, left_index=True, right_index=True, how = 'outer')

  one_x  two1 one_y  two2
0     a     0     a  10.0
1     b     1     b  11.0
2     a     2     c  12.0
3     a     3     d  13.0
4     e     4   NaN   NaN

+ DataFrame有一个便利的join实例，可以直接用index来连接。这个也可以用于其他DataFrame进行连接，要有一样的index但不能有重叠的列

In [121]:
data_3 = pd.DataFrame(
    {'three': ['f','g','h','j'],
     'four':range(16,20)
    }
)
data_3

  three  four
0     f    16
1     g    17
2     h    18
3     j    19

In [122]:
data_1.join(data_3)

  one  two1 three  four
0   a     0     f  16.0
1   b     1     g  17.0
2   a     2     h  18.0
3   a     3     j  19.0
4   e     4   NaN   NaN

In [123]:
data_1

  one  two1
0   a     0
1   b     1
2   a     2
3   a     3
4   e     4

In [124]:
# 增加一列
data_1.assign(three = np.arange(5)) # data_1['three'] = np.arange(5)

  one  two1  three
0   a     0      0
1   b     1      1
2   a     2      2
3   a     3      3
4   e     4      4

In [125]:
data_1 = pd.DataFrame(np.random.randn(3,4), columns = ['a','b','c','d'])
data_2 = pd.DataFrame(np.random.randn(2,3), columns = ['b','d','a'])
data_1

          a         b         c         d
0  0.761900  1.018355 -0.439297 -0.103125
1  0.381727 -0.929038  0.662066  1.987563
2  0.266130 -0.879227  0.826640 -0.943479

In [126]:
data_2

          b         d         a
0  0.109148 -0.255545 -0.328583
1  0.377998  0.419273  0.368986

+ **用concat连接列表**

In [127]:
pd.concat([data_1, data_2], ignore_index = True)

          a         b         c         d
0  0.761900  1.018355 -0.439297 -0.103125
1  0.381727 -0.929038  0.662066  1.987563
2  0.266130 -0.879227  0.826640 -0.943479
3 -0.328583  0.109148       NaN -0.255545
4  0.368986  0.377998       NaN  0.419273

##### **4.8 数据清理**

In [128]:
data = pd.DataFrame(
    {'k1': ['one'] * 3 + ['two'] * 2,
     'k2' : [1,1,2,3,3]
    }
)
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3

In [129]:
# 显示是否重复
data.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

+ **显示重复的数据**

In [130]:
data[data.duplicated()]

    k1  k2
1  one   1
4  two   3

+ **显示不重复的数据**

In [131]:
data[~data.duplicated()]

    k1  k2
0  one   1
2  one   2
3  two   3

+ **删除重复值**

In [132]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3

In [133]:
data['k3'] = 1
data

    k1  k2  k3
0  one   1   1
1  one   1   1
2  one   2   1
3  two   3   1
4  two   3   1

+ **指定删除某些数据**

In [134]:
data.drop_duplicates(['k2','k3'])

    k1  k2  k3
0  one   1   1
2  one   2   1
3  two   3   1

In [135]:
# 替换
data.replace(3, np.nan)

    k1   k2  k3
0  one  1.0   1
1  one  1.0   1
2  one  2.0   1
3  two  NaN   1
4  two  NaN   1

+ **对多个值处理就生成List[]**

In [136]:
data.replace([3,2], np.nan)

    k1   k2   k3
0  one  1.0  1.0
1  one  1.0  1.0
2  one  NaN  1.0
3  two  NaN  1.0
4  two  NaN  1.0

In [137]:
data.replace({3:np.nan, 2:100})

    k1     k2   k3
0  one    1.0  1.0
1  one    1.0  1.0
2  one  100.0  1.0
3  two    NaN  1.0
4  two    NaN  1.0

In [138]:
# 处理缺失值
data = pd.Series([2,3,np.nan,3,6,np.nan])
data

0    2.0
1    3.0
2    NaN
3    3.0
4    6.0
5    NaN
dtype: float64

In [139]:
data.isnull()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [140]:
data.dropna()

0    2.0
1    3.0
3    3.0
4    6.0
dtype: float64

In [141]:
data = pd.DataFrame(np.random.randn(5,4), columns = list('abcd'))
data

          a         b         c         d
0  0.956458 -0.790999 -0.172711 -0.825370
1  0.488571  1.245915 -0.429009  0.967415
2 -0.555147  0.096853  0.468003  1.021349
3 -1.666561  0.946213 -0.546106  1.277561
4 -0.037715 -0.190239 -0.616897  0.450158

In [142]:
data.iloc[1] = np.nan
data['b'] = np.nan
data.iloc[2,1] = 1
data

          a    b         c         d
0  0.956458  NaN -0.172711 -0.825370
1       NaN  NaN       NaN       NaN
2 -0.555147  1.0  0.468003  1.021349
3 -1.666561  NaN -0.546106  1.277561
4 -0.037715  NaN -0.616897  0.450158

In [143]:
# 删除所有包含nan值
data.dropna()

          a    b         c         d
2 -0.555147  1.0  0.468003  1.021349

In [144]:
# 全部是nan的值删掉
data.dropna(how = 'all')

          a    b         c         d
0  0.956458  NaN -0.172711 -0.825370
2 -0.555147  1.0  0.468003  1.021349
3 -1.666561  NaN -0.546106  1.277561
4 -0.037715  NaN -0.616897  0.450158

In [145]:
data.dropna(how = 'all', axis = 1)

          a    b         c         d
0  0.956458  NaN -0.172711 -0.825370
1       NaN  NaN       NaN       NaN
2 -0.555147  1.0  0.468003  1.021349
3 -1.666561  NaN -0.546106  1.277561
4 -0.037715  NaN -0.616897  0.450158

In [146]:
# 填充nan值
data.fillna(0)

          a    b         c         d
0  0.956458  0.0 -0.172711 -0.825370
1  0.000000  0.0  0.000000  0.000000
2 -0.555147  1.0  0.468003  1.021349
3 -1.666561  0.0 -0.546106  1.277561
4 -0.037715  0.0 -0.616897  0.450158

In [147]:
data.fillna(
    {
        'a':1,
        'b':10,
        'c':100,
        'd':1000
    }
)

          a     b           c            d
0  0.956458  10.0   -0.172711    -0.825370
1  1.000000  10.0  100.000000  1000.000000
2 -0.555147   1.0    0.468003     1.021349
3 -1.666561  10.0   -0.546106     1.277561
4 -0.037715  10.0   -0.616897     0.450158

+ **inplace = True改变源文件**

In [148]:
data.a.fillna(data.a.mean())

0    0.956458
1   -0.325741
2   -0.555147
3   -1.666561
4   -0.037715
Name: a, dtype: float64

##### **4.9 字符串操作**

In [149]:
data = pd.DataFrame(
    {
        'k1': ['beijing,haidian,chushou', 'beijing,chaoyang,chushou', 'beijing,fengtai,chuzu'],
        'k2': ['beijing,xicheng,chuzu', 'beijing,shijingshan,chushou', np.nan]
    }
)
data

                         k1                           k2
0   beijing,haidian,chushou        beijing,xicheng,chuzu
1  beijing,chaoyang,chushou  beijing,shijingshan,chushou
2     beijing,fengtai,chuzu                          NaN

In [150]:
data.k1.str.replace('beijing', 'shanghai')

0     shanghai,haidian,chushou
1    shanghai,chaoyang,chushou
2       shanghai,fengtai,chuzu
Name: k1, dtype: object

In [151]:
data.k1.str.contains('chushou')

0     True
1     True
2    False
Name: k1, dtype: bool

+ **读取存在的数据**

In [152]:
data[data.k1.str.contains('chushou')]

                         k1                           k2
0   beijing,haidian,chushou        beijing,xicheng,chuzu
1  beijing,chaoyang,chushou  beijing,shijingshan,chushou

In [153]:
data.k1.str.upper()

0     BEIJING,HAIDIAN,CHUSHOU
1    BEIJING,CHAOYANG,CHUSHOU
2       BEIJING,FENGTAI,CHUZU
Name: k1, dtype: object

In [154]:
data.k1.str.split(',')

0     [beijing, haidian, chushou]
1    [beijing, chaoyang, chushou]
2       [beijing, fengtai, chuzu]
Name: k1, dtype: object

##### **函数映射进行转换**
+ 用于series的map方法接受一个函数，或是一个字典，包含着映射关系，但这里有一个小问题，有大写和小写。因此我们先用str.lower把所有的专辑变成小写

In [155]:
quyu_to_chengshi = {
        'chaoyang': 'beijing',
        'huangpu': 'shanghai',
        'jingan': 'shanghai',
        'haidian': 'beijing',
        'fengtai': 'beijing',
        'tongzhou': 'beijing',
    }

In [156]:
data = pd.Series(['chaoyang', 'jingan', 'huangpu', 'fengtai', 'jingan', 'tongzhou', 'haidian', 'jingan'])
data

0    chaoyang
1      jingan
2     huangpu
3     fengtai
4      jingan
5    tongzhou
6     haidian
7      jingan
dtype: object

In [157]:
data.map(quyu_to_chengshi)

0     beijing
1    shanghai
2    shanghai
3     beijing
4    shanghai
5     beijing
6     beijing
7    shanghai
dtype: object

In [158]:
data.map(lambda x:x.upper())

0    CHAOYANG
1      JINGAN
2     HUANGPU
3     FENGTAI
4      JINGAN
5    TONGZHOU
6     HAIDIAN
7      JINGAN
dtype: object

In [159]:
data = pd.DataFrame(np.random.randn(5,4), columns = list('abcd'))
data

          a         b         c         d
0 -0.257741  0.463781 -0.282075 -0.525324
1  0.056909 -0.996802  0.140049  0.822730
2 -0.233450 -1.028876 -1.844041 -0.426963
3 -0.026272  0.341861 -0.947586 -0.061488
4  1.981544 -0.658793  0.236423  1.636182

In [160]:
data.apply(np.cumsum, axis = 1)

          a         b         c         d
0 -0.257741  0.206040 -0.076036 -0.601360
1  0.056909 -0.939893 -0.799844  0.022886
2 -0.233450 -1.262326 -3.106367 -3.533330
3 -0.026272  0.315589 -0.631997 -0.693484
4  1.981544  1.322751  1.559175  3.195357

In [161]:
data.apply(lambda x:(x.max() - x.min()))

a    2.239285
b    1.492657
c    2.080465
d    2.161506
dtype: float64

+ **每个元素都要执行函数**

In [162]:
data.applymap(lambda x:abs(x))

          a         b         c         d
0  0.257741  0.463781  0.282075  0.525324
1  0.056909  0.996802  0.140049  0.822730
2  0.233450  1.028876  1.844041  0.426963
3  0.026272  0.341861  0.947586  0.061488
4  1.981544  0.658793  0.236423  1.636182

##### **4.10 布尔过滤和数据离散化**
+ **布尔过滤**

In [163]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.012739     0.019706     0.070009     0.018053
std       1.009751     1.014088     0.996462     1.009740
min      -3.222693    -3.407585    -3.088817    -3.279026
25%      -0.701659    -0.685717    -0.589546    -0.671986
50%       0.014487     0.037067     0.107358    -0.015491
75%       0.677529     0.680672     0.774175     0.681268
max       3.289598     3.274027     3.116336     3.275321

+ **取出限定条件下的值**

In [164]:
data[data > 0]

            0         1         2         3
0         NaN       NaN  0.890595  0.668613
1         NaN       NaN  1.292895  1.628188
2    0.394068       NaN       NaN       NaN
3         NaN       NaN  0.340578  0.312677
4         NaN  1.347691  1.022296       NaN
..        ...       ...       ...       ...
995  0.602890       NaN  1.067090  0.526788
996  0.690798       NaN       NaN  0.426609
997       NaN  0.643783  1.612917  1.254385
998       NaN  1.223273  0.944837       NaN
999       NaN  1.023968  0.587197       NaN

[1000 rows x 4 columns]

In [165]:
data[data>0].dropna(how = 'all')

            0         1         2         3
0         NaN       NaN  0.890595  0.668613
1         NaN       NaN  1.292895  1.628188
2    0.394068       NaN       NaN       NaN
3         NaN       NaN  0.340578  0.312677
4         NaN  1.347691  1.022296       NaN
..        ...       ...       ...       ...
995  0.602890       NaN  1.067090  0.526788
996  0.690798       NaN       NaN  0.426609
997       NaN  0.643783  1.612917  1.254385
998       NaN  1.223273  0.944837       NaN
999       NaN  1.023968  0.587197       NaN

[945 rows x 4 columns]

In [166]:
data[np.abs(data)>3].dropna(how = 'all')

            0         1         2         3
67        NaN       NaN       NaN  3.275321
152       NaN       NaN  3.021404       NaN
204       NaN -3.407585       NaN       NaN
336       NaN       NaN       NaN  3.151348
486 -3.067049       NaN       NaN       NaN
502  3.149893       NaN       NaN       NaN
597       NaN       NaN       NaN -3.034803
706       NaN  3.274027       NaN       NaN
713       NaN       NaN       NaN -3.279026
734  3.085688       NaN       NaN       NaN
783  3.289598       NaN       NaN       NaN
813       NaN       NaN -3.088817       NaN
821       NaN  3.138745       NaN       NaN
865       NaN       NaN  3.116336       NaN
912 -3.222693       NaN       NaN       NaN

+ **数据的离散化**

In [167]:
data = pd.DataFrame(np.random.randint(1,50,(20,2)), columns = ['k1','k2'])
data.k1

0     37
1     28
2     34
3     10
4     49
5     33
6     46
7     29
8     30
9     36
10    30
11    14
12    15
13     1
14    38
15    33
16    13
17    32
18     4
19    14
Name: k1, dtype: int32

In [168]:
bins = [0,10,20,30,40,50]
pd.cut(data.k1, bins)

0     (30, 40]
1     (20, 30]
2     (30, 40]
3      (0, 10]
4     (40, 50]
5     (30, 40]
6     (40, 50]
7     (20, 30]
8     (20, 30]
9     (30, 40]
10    (20, 30]
11    (10, 20]
12    (10, 20]
13     (0, 10]
14    (30, 40]
15    (30, 40]
16    (10, 20]
17    (30, 40]
18     (0, 10]
19    (10, 20]
Name: k1, dtype: category
Categories (5, interval[int64, right]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] < (40, 50]]

+ **离散数据的分散个数**

In [169]:
pd.cut(data.k2, bins).value_counts()

(40, 50]    6
(30, 40]    5
(0, 10]     3
(10, 20]    3
(20, 30]    3
Name: k2, dtype: int64

In [170]:
data = np.random.randn(1000)
pd.cut(data,4).value_counts()

(-2.993, -1.332]     96
(-1.332, 0.323]     545
(0.323, 1.978]      344
(1.978, 3.633]       15
dtype: int64

In [171]:
pd.qcut(data,4).value_counts()

(-2.987, -0.775]     250
(-0.775, -0.0358]    250
(-0.0358, 0.614]     250
(0.614, 3.633]       250
dtype: int64

+ **左闭右开**

In [172]:
pd.cut(data,4, right = False).value_counts()

[-2.986, -1.332)     96
[-1.332, 0.323)     545
[0.323, 1.978)      344
[1.978, 3.64)        15
dtype: int64